## groupby

es facil hace restadisticas pero a veces estamos interesados en realizar estadisticas en subconjuntos segun la categoria a la que pertenezaca, por ejemplo queremos saber __la edad promedio para hombre y mujeres__

In [2]:
import pandas as pd
import numpy as np

In [7]:
ruta = r"C:\Users\balti\OneDrive\Desktop\programacion\Analisis-de-datos\teoria\modulo 4\csv\titanic.csv"
df = pd.read_csv(ruta)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

usamos grupoby para agrupar los datos segun valores de una o mas clumnas y los vamos a combinar con algun metodo

In [5]:
df.groupby('Sex').count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [12]:
df.groupby('Sex').mean(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

si queremos restringir el resultado de ciertas columnas podemos hacerlo de varias formas: 
* un es seleccionando la columna que nos interesa operacionar
* otra es seleccionar las columans nesesarias antes del groupby
* y la ultima es seleccionar la columna de interes dsp de hacer el group

In [18]:
# ej 1
df.groupby("Sex").mean(numeric_only=True)['Age']

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [27]:
#ej 2
df[['Survived','Age','Sex']].groupby('Survived').mean(numeric_only=True)

                Age
Survived
0         30.626179
1         28.343690

In [20]:
# ej 3
df.groupby('Sex')['Age'].mean(numeric_only=True)

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [30]:
#promedio de edad segun el sexo
df.groupby('Sex')[['Sex','Age']].mean(numeric_only=True)

              Age
Sex
female  27.915709
male    30.726645

In [41]:
#maximo de edad en cada clase
df.groupby('Pclass')[['Age','Pclass']].max()
df[['Age','Pclass',]].groupby('Pclass').max()

         Age
Pclass
1       80.0
2       70.0
3       74.0

En caso de querer realizar varias operaciones a los mismos
grupos se puede utilizar aggregate (o su alias, agg).

In [44]:
df[['Age','Pclass']].groupby('Pclass').agg(['min','max','mean','std'])

         Age
         min   max       mean        std
Pclass
1       0.92  80.0  38.233441  14.802856
2       0.67  70.0  29.877630  14.001077
3       0.42  74.0  25.140620  12.495398